"""
Name: {เกริกเกียรติ ดำหมี}
SID: {364211760038}
Group: {MIT212}
"""

"""
Question 5:
เขียนโปรแกรมเพื่อคำนวณค่า Body Mass Index (BMI) โดยรับ input เป็นน้ำหนักตัวและส่วนสูง
จากนั้นแสดงผล BMI ทาง output ตามสมการต่อไปนี้

สูตรคำนวนค่าดัชนี้มวลกาย

ิดัชนีมวลกาย = น้ำหนักตัว (kg)/((ส่วนสูง(เมตร)) * (ส่วนสูง(เมตร)))

ตัวอย่างผลลัทพ์

น้ำหนัก: 80
ส่วนสูง(cm):180
ํดัชนีมวลกายของคุณ เท่ากับ 24.5

(10 คะแนน)
"""
import math
height = float(input('ส่วนสูง(เซนติเมตร) :'))
weight = float(input('น้ำหนัก(กิโลกรัม) :'))
bmi = weight%height*height
print('น้ำหนัก (กิโลกรัม):',weight,)
print('ส่วนสูง (เซนติเมตร) :',height,)
print('ํดัชนีมวลกายของคุณ เท่ากับ :',bmi,)